artillery/single-vu.yml
config:
  target: "http://45.77.42.229:3000"
  phases:
    - duration: 1
      arrivalCount: 1
      name: "Single VU baseline"

scenarios:
  - name: "List users (uncached)"
    weight: 40
    flow:
      - get:
          url: "/users"

  - name: "Get single user (cached after first hit)"
    weight: 40
    flow:
      - get:
          url: "/users/{{ $randomNumber(1, 30) }}"

  - name: "Create order"
    weight: 20
    flow:
      - post:
          url: "/orders"
          json:
            userId: "{{ $randomNumber(1, 30) }}"
            total: "{{ $randomNumber(10, 1000) }}"